test/artillery.yaml
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  target: http://k8s-03.tailfbcd0.ts.net:32150
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 1
      name: Warm up phase
  # Load & configure a couple of useful plugins
  # https://docs.art/reference/extensions
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
      thresholds:
        - http.response_time.p99: 100
        - http.response_time.p95: 75
scenarios:
  - flow:
      - loop:
        - get:
            url: "/v1/hello"
        - get:
            url: "/v1/hello/healthz"
        count: 100